books = [
	{'title': "Дэнс, дэнс, дэнс", 'author': "Харуки Мураками", 'year': 2018},
	{'title': "Спеши любить", 'author': "Николас Спаркс", 'year': 2023},
	{'title': "У войны не женское лицо", 'author': "Светлана Алексиевич", 'year': 2022 },
	{'title': "Хороших девочек не убивают", 'author': "Джексон Холли", 'year': 2021},
	{'title': "Гарри Поттер", 'author': "Дж.К.Роулинг", 'year': 1997-2007}]
for i in range(len(books)):
    print(f"---------------------------------- Книга {i + 1} -------------------------------------")
    print(f"Название: {books[i]['title']}, Автор: {books[i]['author']},")
    print(f"------------------------------------{books[i]['year']}----------------------------------------")